export const levelColorMapping = new Map([
  [1, '#ff0202'], // 1级告警
  [2, '#f68808'], // 2级告警
  [3, '#ffdb00'], // 3级告警
  [4, '#2d97ff'], // 4级告警
  [5, '#EA9797'], // 动环告警 通讯中断
  [6, '#06c357'], // 动环告警无告警 正常
  [7, '#8E0505'], // 动环告警 高告警
  [8, '#f68808'], // 动环告警 异常
  [9, '#EEA5A5'] // 动环告警 低告警
  // [4, '#06c357'] // 5级告警
])

export const pureLevelColorMapping = new Map([
  [1, '#ff0202'], // 1级告警
  [2, '#f68808'], // 2级告警
  [3, '#ffdb00'], // 3级告警
  [4, '#2d97ff'], // 4级告警
  [6, '#06c357'] // 无告警（与5级告警同色，意为正常）
  // [5, '#06c357'] // 5级告警
])

export const partLevelColorMapping = new Map([
  [1, '#ff0202'], // 1级告警
  [2, '#f68808'], // 2级告警
  [3, '#ffdb00'], // 3级告警
  [4, '#2d97ff'] // 4级告警
  // [5, '#06c357'] // 5级告警
])

export const fontLevelColorMapping = new Map([
  [1, '紧急'], // 无告警（与5级告警同色，意为正常）
  [2, '主要'], // 1级告警
  [3, '次要'], // 2级告警
  [4, '一般'] // 3级告警
  // [4, '#2d97ff'] // 4级告警
])

export const fontPureLevelColorMapping = new Map([
  [1, '紧急'], // 无告警（与5级告警同色，意为正常）
  [2, '主要'], // 1级告警
  [3, '次要'], // 2级告警
  [4, '一般'], // 3级告警
  [6, '正常'] // 正常
  // [4, '#2d97ff'] // 4级告警
  // [5, '#06c357'] // 5级告警
])
